# Module 1 - Introduction to Pandas
## Pandas Part 1

### Introduction

![austin](http://www.austintexas.gov/sites/default/files/aac_logo.jpg)
You have decided that you want to start your own animal shelter, but you want to get an idea of what that will entail and get more information about planning. You have found out that Austin has one of the largest no-kill animal shelters in the country, and they keep meticulous track of animals that have been taken in and released. However, it is a large file, the online visualization tools provided are terrible, the data is sorted as strings, and the file holds an overwhelming amount  of information. Is there an easy way to look at this data? Can we do this with base Python? Is there a better way?


#### _Our goals today are to be able to_: <br/>

- Import/read data using Pandas
- Identify Pandas objects and manipulate Pandas objects by index and columns
- Filter data using Pandas

#### _Big questions for this lesson_: <br/>
- Why use Pandas? 
 
 (a) Provides methods able analyze data stored in the format Data Scientist most often encounter (.csv, .tsv, or .xlsx). 
 
 (b) Makes it very convenient to load, process, and analyze in the aforementioned formats. 
 
 (c) Along with python visualization packages allows for the visual analysis of tabular data.
 

- When do we want to use NumPy versus Pandas?
- What are the [advantages of using Pandas?](https://stackabuse.com/beginners-tutorial-on-the-pandas-python-library/)
- What are the [disadvantages of using Pandas?](https://wesmckinney.com/blog/apache-arrow-pandas-internals/)
- DataFrames are great for representing real data: rows correspond to instances (examples, observations, etc.), and columns correspond to features of these instances.

### Activation:

<img src="https://cdn-images-1.medium.com/max/1600/1*9IU5fBzJisilYjRAi-f55Q.png" width=600>  




- The data manipulation capabilities of Pandas are built on top of the numpy library.
- Pandas dataframe object represents a spreadsheet with cell values, column names, and row index labels.

### 1. Importing and reading data with Pandas!

#### Let's use pandas to read some csv files so we can interact with them.

In [2]:
# First, let's check which directory we are in so the files we expect to see are there.
!pwd
!ls -la

/c/Users/Akshay Indusekar/hello/code/dc-ds-111819/module-1/day-5-pandas-1
total 52
drwxr-xr-x 1 Akshay Indusekar 197121     0 Nov 22 14:05 .
drwxr-xr-x 1 Akshay Indusekar 197121     0 Nov 22 14:03 ..
drwxr-xr-x 1 Akshay Indusekar 197121     0 Nov 22 14:05 .ipynb_checkpoints
drwxr-xr-x 1 Akshay Indusekar 197121     0 Nov 22 14:03 data
-rw-r--r-- 1 Akshay Indusekar 197121 42388 Nov 22 14:05 pandas-1.ipynb

In [1]:
!pip install ipyvolume

Collecting ipyvolume
  Downloading https://files.pythonhosted.org/packages/c4/be/09982f3bce56da844c5ee4642a8bfae9908e61d7e6999e7e91479cc64b6a/ipyvolume-0.5.2-py2.py3-none-any.whl (2.9MB)
Collecting pythreejs>=1.0.0 (from ipyvolume)
  Downloading https://files.pythonhosted.org/packages/41/21/8307f7308686a08fa7be43ff5e25daf041c8b46d5874a243c262e4665cb8/pythreejs-2.1.1-py2.py3-none-any.whl (4.2MB)
Collecting traittypes (from ipyvolume)
  Downloading https://files.pythonhosted.org/packages/9c/d1/8d5bd662703cc1764d986f6908a608777305946fa634d34c470cd4a1e729/traittypes-0.2.1-py2.py3-none-any.whl
Requirement already satisfied: requests in c:\users\akshay indusekar\anaconda3\lib\site-packages (from ipyvolume) (2.22.0)
Requirement already satisfied: numpy in c:\users\akshay indusekar\anaconda3\lib\site-packages (from ipyvolume) (1.16.5)
Requirement already satisfied: traitlets in c:\users\akshay indusekar\anaconda3\lib\site-packages (from ipyvolume) (4.3.3)
Collecting ipywebrtc (from ipyvolume)
  Downloading https://files.pythonhosted.org/packages/65/6b/b78b2b6f96fb2299eebae3083d3625cedb62a35ddc9815897f25c8093edd/ipywebrtc-0.5.0-py2.py3-none-any.whl (1.1MB)
Requirement already satisfied: Pillow in c:\users\akshay indusekar\anaconda3\lib\site-packages (from ipyvolume) (6.2.0)
Requirement already satisfied: ipywidgets>=7.5 in c:\users\akshay indusekar\anaconda3\lib\site-packages (from ipyvolume) (7.5.1)
Collecting ipydatawidgets>=1.1.1 (from pythreejs>=1.0.0->ipyvolume)
  Downloading https://files.pythonhosted.org/packages/3d/62/eb221e1efaebf42af438c109088fbeea00561e5567a202fc8425d7b9c34d/ipydatawidgets-4.0.1-py2.py3-none-any.whl (250kB)
Requirement already satisfied: chardet<3.1.0,>=3.0.2 in c:\users\akshay indusekar\anaconda3\lib\site-packages (from requests->ipyvolume) (3.0.4)
Requirement already satisfied: certifi>=2017.4.17 in c:\users\akshay indusekar\anaconda3\lib\site-packages (from requests->ipyvolume) (2019.9.11)
Requirement already satisfied: idna<2.9,>=2.5 in c:\users\akshay indusekar\anaconda3\lib\site-packages (from requests->ipyvolume) (2.8)
Requirement already satisfied: urllib3!=1.25.0,!=1.25.1,<1.26,>=1.21.1 in c:\users\akshay indusekar\anaconda3\lib\site-packages (from requests->ipyvolume) (1.24.2)
Requirement already satisfied: six in c:\users\akshay indusekar\anaconda3\lib\site-packages (from traitlets->ipyvolume) (1.12.0)
Requirement already satisfied: decorator in c:\users\akshay indusekar\anaconda3\lib\site-packages (from traitlets->ipyvolume) (4.4.0)
Requirement already satisfied: ipython-genutils in c:\users\akshay indusekar\anaconda3\lib\site-packages (from traitlets->ipyvolume) (0.2.0)
Requirement already satisfied: ipython>=4.0.0; python_version >= "3.3" in c:\users\akshay indusekar\anaconda3\lib\site-packages (from ipywidgets>=7.5->ipyvolume) (7.8.0)
Requirement already satisfied: nbformat>=4.2.0 in c:\users\akshay indusekar\anaconda3\lib\site-packages (from ipywidgets>=7.5->ipyvolume) (4.4.0)
Requirement already satisfied: widgetsnbextension~=3.5.0 in c:\users\akshay indusekar\anaconda3\lib\site-packages (from ipywidgets>=7.5->ipyvolume) (3.5.1)
Requirement already satisfied: ipykernel>=4.5.1 in c:\users\akshay indusekar\anaconda3\lib\site-packages (from ipywidgets>=7.5->ipyvolume) (5.1.2)
Requirement already satisfied: prompt-toolkit<2.1.0,>=2.0.0 in c:\users\akshay indusekar\anaconda3\lib\site-packages (from ipython>=4.0.0; python_version >= "3.3"->ipywidgets>=7.5->ipyvolume) (2.0.10)
Requirement already satisfied: pickleshare in c:\users\akshay indusekar\anaconda3\lib\site-packages (from ipython>=4.0.0; python_version >= "3.3"->ipywidgets>=7.5->ipyvolume) (0.7.5)
Requirement already satisfied: colorama; sys_platform == "win32" in c:\users\akshay indusekar\anaconda3\lib\site-packages (from ipython>=4.0.0; python_version >= "3.3"->ipywidgets>=7.5->ipyvolume) (0.4.1)
Requirement already satisfied: setuptools>=18.5 in c:\users\akshay indusekar\anaconda3\lib\site-packages (from ipython>=4.0.0; python_version >= "3.3"->ipywidgets>=7.5->ipyvolume) (41.4.0)
Requirement already satisfied: pygments in c:\users\akshay indusekar\anaconda3\lib\site-packages (from ipython>=4.0.0; python_version >= "3.3"->ipywidgets>=7.5->ipyvolume) (2.4.2)
Requirement already satisfied: backcall in c:\users\akshay indusekar\anaconda3\lib\site-packages (from ipython>=4.0.0; python_version >= "3.3"->ipywidgets>=7.5->ipyvolume) (0.1.0)
Requirement already satisfied: jedi>=0.10 in c:\users\akshay indusekar\anaconda3\lib\site-packages (from ipython>=4.0.0; python_version >= "3.3"->ipywidgets>=7.5->ipyvolume) (0.15.1)
Requirement already satisfied: jupyter-core in c:\users\akshay indusekar\anaconda3\lib\site-packages (from nbformat>=4.2.0->ipywidgets>=7.5->ipyvolume) (4.5.0)
Requirement already satisfied: jsonschema!=2.5.0,>=2.4 in c:\users\akshay indusekar\anaconda3\lib\site-packages (from nbformat>=4.2.0->ipywidgets>=7.5->ipyvolume) (3.0.2)
Requirement already satisfied: notebook>=4.4.1 in c:\users\akshay indusekar\anaconda3\lib\site-packages (from widgetsnbextension~=3.5.0->ipywidgets>=7.5->ipyvolume) (6.0.1)
Requirement already satisfied: tornado>=4.2 in c:\users\akshay indusekar\anaconda3\lib\site-packages (from ipykernel>=4.5.1->ipywidgets>=7.5->ipyvolume) (6.0.3)
Requirement already satisfied: jupyter-client in c:\users\akshay indusekar\anaconda3\lib\site-packages (from ipykernel>=4.5.1->ipywidgets>=7.5->ipyvolume) (5.3.3)
Requirement already satisfied: wcwidth in c:\users\akshay indusekar\anaconda3\lib\site-packages (from prompt-toolkit<2.1.0,>=2.0.0->ipython>=4.0.0; python_version >= "3.3"->ipywidgets>=7.5->ipyvolume) (0.1.7)
Requirement already satisfied: parso>=0.5.0 in c:\users\akshay indusekar\anaconda3\lib\site-packages (from jedi>=0.10->ipython>=4.0.0; python_version >= "3.3"->ipywidgets>=7.5->ipyvolume) (0.5.1)
Requirement already satisfied: attrs>=17.4.0 in c:\users\akshay indusekar\anaconda3\lib\site-packages (from jsonschema!=2.5.0,>=2.4->nbformat>=4.2.0->ipywidgets>=7.5->ipyvolume) (19.2.0)
Requirement already satisfied: pyrsistent>=0.14.0 in c:\users\akshay indusekar\anaconda3\lib\site-packages (from jsonschema!=2.5.0,>=2.4->nbformat>=4.2.0->ipywidgets>=7.5->ipyvolume) (0.15.4)
Requirement already satisfied: terminado>=0.8.1 in c:\users\akshay indusekar\anaconda3\lib\site-packages (from notebook>=4.4.1->widgetsnbextension~=3.5.0->ipywidgets>=7.5->ipyvolume) (0.8.2)
Requirement already satisfied: jinja2 in c:\users\akshay indusekar\anaconda3\lib\site-packages (from notebook>=4.4.1->widgetsnbextension~=3.5.0->ipywidgets>=7.5->ipyvolume) (2.10.3)
Requirement already satisfied: prometheus-client in c:\users\akshay indusekar\anaconda3\lib\site-packages (from notebook>=4.4.1->widgetsnbextension~=3.5.0->ipywidgets>=7.5->ipyvolume) (0.7.1)
Requirement already satisfied: nbconvert in c:\users\akshay indusekar\anaconda3\lib\site-packages (from notebook>=4.4.1->widgetsnbextension~=3.5.0->ipywidgets>=7.5->ipyvolume) (5.6.0)
Requirement already satisfied: pyzmq>=17 in c:\users\akshay indusekar\anaconda3\lib\site-packages (from notebook>=4.4.1->widgetsnbextension~=3.5.0->ipywidgets>=7.5->ipyvolume) (18.1.0)
Requirement already satisfied: Send2Trash in c:\users\akshay indusekar\anaconda3\lib\site-packages (from notebook>=4.4.1->widgetsnbextension~=3.5.0->ipywidgets>=7.5->ipyvolume) (1.5.0)
Requirement already satisfied: python-dateutil>=2.1 in c:\users\akshay indusekar\anaconda3\lib\site-packages (from jupyter-client->ipykernel>=4.5.1->ipywidgets>=7.5->ipyvolume) (2.8.0)
Requirement already satisfied: pywin32>=1.0; sys_platform == "win32" in c:\users\akshay indusekar\anaconda3\lib\site-packages (from jupyter-client->ipykernel>=4.5.1->ipywidgets>=7.5->ipyvolume) (223)
Requirement already satisfied: MarkupSafe>=0.23 in c:\users\akshay indusekar\anaconda3\lib\site-packages (from jinja2->notebook>=4.4.1->widgetsnbextension~=3.5.0->ipywidgets>=7.5->ipyvolume) (1.1.1)
Requirement already satisfied: pandocfilters>=1.4.1 in c:\users\akshay indusekar\anaconda3\lib\site-packages (from nbconvert->notebook>=4.4.1->widgetsnbextension~=3.5.0->ipywidgets>=7.5->ipyvolume) (1.4.2)
Requirement already satisfied: defusedxml in c:\users\akshay indusekar\anaconda3\lib\site-packages (from nbconvert->notebook>=4.4.1->widgetsnbextension~=3.5.0->ipywidgets>=7.5->ipyvolume) (0.6.0)
Requirement already satisfied: entrypoints>=0.2.2 in c:\users\akshay indusekar\anaconda3\lib\site-packages (from nbconvert->notebook>=4.4.1->widgetsnbextension~=3.5.0->ipywidgets>=7.5->ipyvolume) (0.3)
Requirement already satisfied: bleach in c:\users\akshay indusekar\anaconda3\lib\site-packages (from nbconvert->notebook>=4.4.1->widgetsnbextension~=3.5.0->ipywidgets>=7.5->ipyvolume) (3.1.0)
Requirement already satisfied: mistune<2,>=0.8.1 in c:\users\akshay indusekar\anaconda3\lib\site-packages (from nbconvert->notebook>=4.4.1->widgetsnbextension~=3.5.0->ipywidgets>=7.5->ipyvolume) (0.8.4)
Requirement already satisfied: testpath in c:\users\akshay indusekar\anaconda3\lib\site-packages (from nbconvert->notebook>=4.4.1->widgetsnbextension~=3.5.0->ipywidgets>=7.5->ipyvolume) (0.4.2)
Requirement already satisfied: webencodings in c:\users\akshay indusekar\anaconda3\lib\site-packages (from bleach->nbconvert->notebook>=4.4.1->widgetsnbextension~=3.5.0->ipywidgets>=7.5->ipyvolume) (0.5.1)
Installing collected packages: traittypes, ipydatawidgets, pythreejs, ipywebrtc, ipyvolume
Successfully installed ipydatawidgets-4.0.1 ipyvolume-0.5.2 ipywebrtc-0.5.0 pythreejs-2.1.1 traittypes-0.2.1

In [4]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\akshay indusekar\anaconda3\lib\site-packages (0.25.1)
Requirement already satisfied: numpy>=1.13.3 in c:\users\akshay indusekar\anaconda3\lib\site-packages (from pandas) (1.16.5)
Requirement already satisfied: pytz>=2017.2 in c:\users\akshay indusekar\anaconda3\lib\site-packages (from pandas) (2019.3)
Requirement already satisfied: python-dateutil>=2.6.1 in c:\users\akshay indusekar\anaconda3\lib\site-packages (from pandas) (2.8.0)
Requirement already satisfied: six>=1.5 in c:\users\akshay indusekar\anaconda3\lib\site-packages (from python-dateutil>=2.6.1->pandas) (1.12.0)

In [5]:
import pandas as pd

example_csv = pd.read_csv('data/example1.csv')

There is also `read_excel`, `read_html`, and many other pandas `read_` functions.  
http://pandas.pydata.org/pandas-docs/stable/user_guide/io.html

In [6]:
example_csv.describe()

          Title1 Title2    Title3
count          2      2         2
unique         2      2         2
top     example1    two  example3
freq           1      1         1

Try loading in the example file in the `data` directory called `made_up_jobs.csv` using pandas.

In [7]:
#read in your csv here!
muj=pd.read_csv('data/made_up_jobs.csv')

#remember that it's nice to be able to look at your data, so let's do that here, too.
muj.head()

   ID           Name                       Job  Years Employed
0   0   Bob Bobberty  Underwater Basket Weaver              13
1   1   Susan Smells             Salad Spinner               5
2   2  Alex Lastname      Productivity Manager               2
3   3        Rudy P.                Being cool              55
4   4        Rudy G.  Being compared to Rudy P              50

You can also load in data by using the url of an associated dataset. The lines that are commented out will allow you to get a csv directly from a website. I have included this dataset in the repo, so we don't have to deal with downloading issues.

In [8]:
# shelter_data = pd.read_csv('https://data.austintexas.gov/api/views/9t4d-g238/rows.csv?accessType=DOWNLOAD')
# this link is copied directly from the download option for CSV

shelter_data = pd.read_csv('./data/Austin_Animal_Center_Outcomes.csv')

shelter_data.head()

,Animal ID,Name,DateTime,MonthYear,Date of Birth,Outcome Type,Outcome Subtype,Animal Type,Sex upon Outcome,Age upon Outcome,Breed,Color
0,A789027,Lennie,02/17/2019 11:44:00 AM,02/17/2019 11:44:00 AM,02/13/2017,Adoption,NaN,Dog,Neutered Male,2 years,Chihuahua Shorthair Mix,Cream
1,A720371,Moose,02/13/2016 05:59:00 PM,02/13/2016 05:59:00 PM,10/08/2015,Adoption,NaN,Dog,Neutered Male,4 months,Anatol Shepherd/Labrador Retriever,Buff
2,A674754,NaN,03/18/2014 11:47:00 AM,03/18/2014 11:47:00 AM,03/12/2014,Transfer,Partner,Cat,Intact Male,6 days,Domestic Shorthair Mix,Orange Tabby
3,A689724,*Donatello,10/18/2014 06:52:00 PM,10/18/2014 06:52:00 PM,08/01/2014,Adoption,NaN,Cat,Neutered Male,2 months,Domestic Shorthair Mix,Black
4,A680969,*Zeus,08/05/2014 04:59:00 PM,08/05/2014 04:59:00 PM,06/03/2014,Adoption,NaN,Cat,Neutered Male,2 months,Domestic Shorthair Mix,White/Orange Tabby

Now that we can read in data, let's get more comfortable with our Pandas data structures.

In [9]:
type(shelter_data)

pandas.core.frame.DataFrame

In [10]:
# Now that data is read let's look at it's shape
print(shelter_data.shape)

(111601, 12)

In [11]:
# What are the names of the columns
print(shelter_data.columns)

Index(['Animal ID', 'Name', 'DateTime', 'MonthYear', 'Date of Birth',
       'Outcome Type', 'Outcome Subtype', 'Animal Type', 'Sex upon Outcome',
       'Age upon Outcome', 'Breed', 'Color'],
      dtype='object')

In [19]:
# What are the different data types present in our data
print(shelter_data.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 111601 entries, 0 to 111600
Data columns (total 13 columns):
Animal ID           111601 non-null object
Name                76422 non-null object
DateTime            111601 non-null object
MonthYear           111601 non-null object
Date of Birth       111601 non-null object
Outcome Type        111595 non-null object
Outcome Subtype     50807 non-null object
Animal Type         111601 non-null object
Sex upon Outcome    111597 non-null object
Age upon Outcome    111579 non-null object
Breed               111601 non-null object
Color               111601 non-null object
new_col             111601 non-null int64
dtypes: int64(1), object(12)
memory usage: 11.1+ MB
None

In [13]:
# We can find the type of a particular columns in a data frame in this way.
ID_series = shelter_data['Animal ID']
type(ID_series)

pandas.core.series.Series

In [17]:
shelter_data['new_col'] = 0

In [18]:
shelter_data.Breed.? #cannot create new column with .notation 
#.? tab shows more options

0                    Chihuahua Shorthair Mix
1         Anatol Shepherd/Labrador Retriever
2                     Domestic Shorthair Mix
3                     Domestic Shorthair Mix
4                     Domestic Shorthair Mix
                         ...
111596                Domestic Shorthair Mix
111597               Chihuahua Shorthair Mix
111598                Domestic Shorthair Mix
111599                   Norfolk Terrier Mix
111600                Domestic Shorthair Mix
Name: Breed, Length: 111601, dtype: object

### 2. Utilizing and identifying Pandas objects

- What is a DataFrame object and what is a Series object? 
- How are they different from Python lists?

These are questions we will cover in this section. To start, let's start with this list of fruits.

In [20]:
fruits = ['Apple', 'Orange', 'Watermelon', 'Lemon', 'Mango']

print(fruits)

['Apple', 'Orange', 'Watermelon', 'Lemon', 'Mango']

Using our list of fruits, we can create a pandas object called a 'series' which is much like an array or a vector.

In [21]:
fruits_series = pd.Series(fruits)

print(fruits_series)
type(fruits_series)

0         Apple
1        Orange
2    Watermelon
3         Lemon
4         Mango
dtype: object

pandas.core.series.Series

One difference between python **list objects** and pandas **series objects** is the fact that you can define the index manually for a **series objects**.

In [22]:
ind = ['a', 'b', 'c', 'd', 'e']

fruits_series = pd.Series(fruits, index=ind)

print(fruits_series)

a         Apple
b        Orange
c    Watermelon
d         Lemon
e         Mango
dtype: object

With a partner, create your own custom series from a list of lists.

In [ ]:
list_of_lists = [['cat'], ['dog'], ['horse'], ['cow'], ['macaw']]

# create custom indices for your series
ind = ['a', 'b', 'c', 'd', 'e']

elements=[x[0].lower() for x in list_of_lists]

In [23]:
# create the series using your list objects
# You can use either a for loop or also pd.Series
list_of_lists_series = pd.Series(elements, index=ind)

# print your series
print(list_of_lists_series)
type(list_of_lists_series)

a      cat
b      dog
c    horse
d      cow
e    macaw
dtype: object

pandas.core.series.Series

In [ ]:
lambda x: x.split()

We can do a simliar thing with Python dictionaries. This time, however, we will create a DataFrame object from a python dictionary.

In [24]:
# Dictionary with list object in values
student_dict = {
    'name': ['Samantha', 'Alex', 'Dante'],
    'age': ['35', '17', '26'],
    'city': ['Houston', 'Seattle', 'New york']
}

students_df = pd.DataFrame(student_dict)

students_df.head()

       name age      city
0  Samantha  35   Houston
1      Alex  17   Seattle
2     Dante  26  New york

In [14]:
#to find data types of columns
students_df.dtypes

name    object
age     object
city    object
dtype: object

Let's change the data type of ages to int.

In [19]:
# We can also change a columns type but the change has to make sense.
students_df.age = students_df.age.values

#Uncomment line below and observe what happens when trying to convert student's name to int or float
#students_df.name = students_df.name.astype(int)

#How about what happens converting numeric to string
students_df.age = students_df.age.astype(str)

students_df.dtypes

name    object
age     object
city    object
dtype: object

We can also use a custom index for these items. For example, we might want them to be the individual student ID numbers.

In [26]:
school_ids = ['1111', '1145', '0096']

# Notice here we use pd.DataFrame not pd.Series as we did for a pandas series.
students_df = pd.DataFrame(student_dict, index=school_ids)

students_df.head()

          name age      city
1111  Samantha  35   Houston
1145      Alex  17   Seattle
0096     Dante  26  New york

Using Pandas, we can also rename column names.

In [27]:
students_df.columns = ['NAME', 'AGE', 'HOME']
students_df.head()

          NAME AGE      HOME
1111  Samantha  35   Houston
1145      Alex  17   Seattle
0096     Dante  26  New york

Or, we can also change the column names using the rename function.

In [28]:
students_df.rename(columns={"AGE": "YEARS"})

          NAME YEARS      HOME
1111  Samantha    35   Houston
1145      Alex    17   Seattle
0096     Dante    26  New york

In [29]:
# Notice what happens when we print students_df

students_df

          NAME AGE      HOME
1111  Samantha  35   Houston
1145      Alex  17   Seattle
0096     Dante  26  New york

In [30]:
# If you want the file to save over itself, use the option `inplace = True`.
students_df.rename(columns={'AGE': 'YEARS'}, inplace=True)
students_df.head()

          NAME YEARS      HOME
1111  Samantha    35   Houston
1145      Alex    17   Seattle
0096     Dante    26  New york

Similarly, there is a tool to remove rows and columns from your DataFrame

In [31]:
students_df.drop(columns=['YEARS', 'HOME'])

          NAME
1111  Samantha
1145      Alex
0096     Dante

In [32]:
#Notice again what happens if we print students_df 
students_df

          NAME YEARS      HOME
1111  Samantha    35   Houston
1145      Alex    17   Seattle
0096     Dante    26  New york

In [33]:
students_df.drop(columns=['YEARS', 'HOME'], inplace=True)
students_df

          NAME
1111  Samantha
1145      Alex
0096     Dante

If you want the file to save over itself, use the option `inplace = True`.

Every function has options. Let's read more about `drop` [here](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.drop.html)

### 3. Filtering Data Using Pandas
There are several ways to grab particular data from a DataFrame. 
- Python lists allow for selection of data only through integer location. 
- You can use a single integer or slice notation to make the selection but NOT a list of integers.
- Dictionaries only allow selection with a single label. Slices and lists of labels are not allowed.

In [34]:
l = [1, 2, 3, 4, 5]
l[[0, 5]]

TypeError: list indices must be integers or slices, not list

### DataFrames can be indexed by column name (label) or row name (index) or by position.   
#### The `.loc` method is used for indexing by name.  
#### While `.iloc` is used for indexing by number.

In [35]:
student_dict = {
    'name': ['Samantha', 'Alex', 'Dante'],
    'age': ['35', '17', '26'],
    'city': ['Houston', 'Seattle', 'New york']
}

students_df = pd.DataFrame(student_dict)

In [36]:
students_df.loc[:, 'name']

0    Samantha
1        Alex
2       Dante
Name: name, dtype: object

### Let's take a look at `.iloc`
#### `.iloc` takes slices based on index position.
#### `.iloc` stands for integer location so that should help with remember what it does
#### `.iloc`[row , column]

In [37]:
# returns the first row
students_df.iloc[0]

name    Samantha
age           35
city     Houston
Name: 0, dtype: object

In [38]:
# returns the first column
students_df.iloc[:, 0]

0    Samantha
1        Alex
2       Dante
Name: name, dtype: object

In [39]:
# returns first two rows notice that ILOC performs regular python slicing.
students_df.iloc[0:2]

       name age     city
0  Samantha  35  Houston
1      Alex  17  Seattle

In [40]:
# returns the first two columns
students_df.iloc[:, 0:2]

       name age
0  Samantha  35
1      Alex  17
2     Dante  26

In [41]:
# returns first row and columns 1 and 2
students_df.iloc[0:1, 0:2]

       name age
0  Samantha  35

### How would we use `.iloc` to return the last item in the last row?

In [48]:
# return the last item in the last row using iloc
students_df.iloc[2][2]

'New york'

### How would we use `.iloc` to return the last item in the last column?

In [50]:
# return the last item in the last column using iloc
students_df.iloc[-1][-1]

'New york'

### What if we only want certain columns or rows?

In [51]:
# Don't do students_df.iloc[0, 2]
students_df.iloc[[0, 2]]

       name age      city
0  Samantha  35   Houston
2     Dante  26  New york

In [52]:
students_df.iloc[[0, 2], [0, 2]]

       name      city
0  Samantha   Houston
2     Dante  New york

In [53]:
id(students_df)

1942846551048

In [56]:
new df = students_df.copy()

SyntaxError: invalid syntax (<ipython-input-56-7b7d30a0aea9>, line 1)

### Let's take a look at `.loc`
#### Label based method. 
#### Names or labels of the index is used when taking slices.
#### Also supports boolean subsetting.

In [57]:
# We will use loc to return rows and columns based on labels. Let's look at the students_df DataFrame again.
students_df

       name age      city
0  Samantha  35   Houston
1      Alex  17   Seattle
2     Dante  26  New york

In [58]:
# returns the student information associated with index 0
students_df.loc[0]

name    Samantha
age           35
city     Houston
Name: 0, dtype: object

In [59]:
# returns the student information for row index 0 to 2 inclusive.
# note iloc would return normal python slicing not including 2 as demonstrated above.
students_df.loc[0:2]

       name age      city
0  Samantha  35   Houston
1      Alex  17   Seattle
2     Dante  26  New york

In [63]:
# returns the column labeled 'age'
students_df.loc[:, 'age']

0    35
1    17
2    26
Name: age, dtype: object

In [61]:
# returns the column labeled 'age' and index values 1 to 2.
# gives us the values of the rows with index from 1 to 2 (inclusive)
# and columns labeled age"
students_df.loc[1:2, 'age']

1    17
2    26
Name: age, dtype: object

In [62]:
# returns the column labeled 'age' and index values 1 to 2.
# gives us the values of the rows with index from 1 to 2 (inclusive)
# and columns labeled age to city (inclusive)"
students_df.loc[1:2, 'age':'city']

  age      city
1  17   Seattle
2  26  New york

In [64]:
# What should we get?
students_df.loc[1:2, ['name', 'city']]

    name      city
1   Alex   Seattle
2  Dante  New york

In [65]:
# How about?
students_df.loc[[0, 2], ['name', 'city']]

       name      city
0  Samantha   Houston
2     Dante  New york

In [66]:
# if index rearranged
school_ids = ['5', '11', '3']
students_df = pd.DataFrame(student_dict, index=school_ids)

In [67]:
students_df

        name age      city
5   Samantha  35   Houston
11      Alex  17   Seattle
3      Dante  26  New york

In [68]:
# What should we get now?
students_df.loc[[0, 2], ['name', 'city']]

KeyError: "None of [Int64Index([0, 2], dtype='int64')] are in the [index]"

In [69]:
# What should we get now?
students_df.loc[['5', '11'], ['name', 'city']]

        name     city
5   Samantha  Houston
11      Alex  Seattle

In [70]:
students_df.set_index("name", inplace=True)
students_df

         age      city
name
Samantha  35   Houston
Alex      17   Seattle
Dante     26  New york

In [71]:
students_df.loc[['Samantha']]

         age     city
name
Samantha  35  Houston

In [72]:
# Subsetting nonconsecutive rows
students_df.loc[['Samantha', 'Dante']]

         age      city
name
Samantha  35   Houston
Dante     26  New york

In [73]:
# Samantha to the end
students_df.loc['Samantha':]

         age      city
name
Samantha  35   Houston
Alex      17   Seattle
Dante     26  New york

In [ ]:
# return the first and last rows using one loc command

### Boolean Subsetting

In [74]:
student_dict = {
    'name': ['Samantha', 'Alex', 'Dante', 'Samantha'],
    'age': ['35', '17', '26', '21'],
    'city': ['Houston', 'Seattle', 'New york', 'Atlanta'],
    'state': ['Texas', 'Washington', 'New York', 'Georgia']
}

students_df = pd.DataFrame(student_dict)

In [75]:
# The statement data[‘name’] == ‘Samantha’] produces a Pandas Series with a True/False value for every row
# in the ‘data’ DataFrame, where there are “True” values for the rows where the name is “Samantha”.
# These type of boolean arrays can be passed directly to the .loc indexer.
students_df.loc[students_df['name'] == 'Samantha']

       name age     city    state
0  Samantha  35  Houston    Texas
3  Samantha  21  Atlanta  Georgia

In [76]:
# What about if we only want the city and state of the selected students with the name Samantha?
students_df.loc[students_df['name'] == 'Samantha', ['city', 'state']]

      city    state
0  Houston    Texas
3  Atlanta  Georgia

In [77]:
# What amount if we want to select a student of a specific age?
students_df.loc[students_df['age'] == '21']

       name age     city    state
3  Samantha  21  Atlanta  Georgia

In [78]:
# What amount if we want to select a student of a specific age?
students_df.loc[(students_df['age'] == '21') &
                (students_df['city'] == 'Atlanta')]

       name age     city    state
3  Samantha  21  Atlanta  Georgia

In [80]:
# What should be returned?
students_df.loc[(students_df['age'] == '35') &
                (students_df['city'] == 'Atlanta')]

Empty DataFrame
Columns: [name, age, city, state]
Index: []

### Lesson Recap
Pandas combines the power of python lists (selection via integer location) and dictionaries (selection by label)

`.iloc` is primarily integer position based (from 0 to length-1 of the axis), but may also be used with a boolean array.

`.iloc` will raise IndexError if a requested indexer is out-of-bounds, except slice indexers which allow out-of-bounds indexing (this conforms with python/numpy slice semantics).

`.loc` is primarily label based, but may also be used with a boolean array.

#### Warning Note that contrary to usual python slices, both the start and the stop are included.

`.loc` will raise a keyError when any items are not found.

### Pandas
- The data structures in Pandas are implemented using series and dataframe classes.  
- A series is a one-dimensional indexed array of some fixed data type.  
- While a dataframe is a two-dimensional data structure like a table where each column contains data of the same type.  
- DataFrames are great for representing real data: rows correspond to instances (examples, observations, etc.), and columns correspond to features of these instances.

### CLASS ASSIGNMENT
Now that we have all of these new tools in our tool belt, use these tools on the shelter data set! 
- Use `shelter_data.columns` to get the list of column names.
- Subset the data by '`Outcome Subtype`.
- Subset the data by '`Outcome Subtype` `Adoption` and only return the `Animal Type` column. 
- Subset the data by '`Outcome Subtype` `Adoption` and only return the `Animal Type` column with only `Cat`. 
- Play around with your new tools on the data set.
- For extra credit: What are the data types returned from the different subsetting? Is what returned a series or dataframe?

In [29]:
import pandas as pd
shelter_data = pd.read_csv('./data/Austin_Animal_Center_Outcomes.csv')
shelter_data.head()

,Animal ID,Name,DateTime,MonthYear,Date of Birth,Outcome Type,Outcome Subtype,Animal Type,Sex upon Outcome,Age upon Outcome,Breed,Color
0,A806093,Lincoln,10/11/2019 03:49:00 PM,10/11/2019 03:49:00 PM,10/09/2011,Transfer,Partner,Dog,Neutered Male,8 years,Toy Poodle,White
1,A806039,Pochis,10/11/2019 03:47:00 PM,10/11/2019 03:47:00 PM,07/05/2018,Transfer,Partner,Dog,Neutered Male,1 year,Miniature Schnauzer/Yorkshire Terrier,Tan
2,A805889,Monkey,10/11/2019 03:46:00 PM,10/11/2019 03:46:00 PM,10/03/2016,Transfer,Partner,Dog,Spayed Female,3 years,Chihuahua Shorthair,Tan
3,A806468,NaN,10/11/2019 03:42:00 PM,10/11/2019 03:42:00 PM,10/04/2019,Transfer,Partner,Cat,Intact Female,1 week,Domestic Shorthair,Tortie
4,A806467,NaN,10/11/2019 03:42:00 PM,10/11/2019 03:42:00 PM,10/04/2019,Transfer,Partner,Cat,Intact Female,1 week,Domestic Shorthair,Tortie

In [35]:
shelter_data['Outcome Type'].value_counts()

Adoption           47598
Transfer           32809
Return to Owner    19404
Euthanasia          7489
Died                1023
Rto-Adopt            488
Disposal             421
Missing               66
Relocate              20
Name: Outcome Type, dtype: int64